In [1]:
import pandas as pd

df_system_access = pd.read_csv('../data/system_access.csv')
df_employees = pd.read_csv('../data/employees.csv')
print (df_system_access, df_employees)

        id    access_level
0     3045  Contract Entry
1     3051  Contract Entry
2     3068  Contract Entry
3     3097   Account Admin
4     3133  Contract Entry
..     ...             ...
833  24862  Contract Entry
834  24864  Contract Entry
835  24885   Account Admin
836  24890  Contract Entry
837  24896   Account Admin

[838 rows x 2 columns]     employee_number  first_name   last_name  \
0         EMP003037     Juliana    Burbudge
1         EMP003045      Lizzie        Blue
2         EMP003051     Marjory    Selcraig
3         EMP003068      Aguste    O'Connor
4         EMP003097     Clemens      Kopman
..              ...         ...         ...
970       EMP024864    Kristina       Yakov
971       EMP024885   Margarita  Habbergham
972       EMP024890    Prescott   Southward
973       EMP024896       Raine     Learned
974       EMP024931  Frederique        Fant

                                    email              title
0        juliana.burbudge@consultants.com  Director of Sales
1             lizzie.blue@consultants.com    Sales Assistant
2        marjory.selcraig@consultants.com    Sales Assistant
3         aguste.o'connor@consultants.com    Sales Assistant
4          clemens.kopman@consultants.com    Account Manager
..                                    ...                ...
970        kristina.yakov@consultants.com    Sales Assistant
971  margarita.habbergham@consultants.com    Account Manager
972    prescott.southward@consultants.com    Sales Assistant
973         raine.learned@consultants.com    Account Manager
974       frederique.fant@consultants.com    Account Manager

[975 rows x 5 columns]

In [2]:
df_employees.head()

,employee_number,first_name,last_name,email,title
0,EMP003037,Juliana,Burbudge,juliana.burbudge@consultants.com,Director of Sales
1,EMP003045,Lizzie,Blue,lizzie.blue@consultants.com,Sales Assistant
2,EMP003051,Marjory,Selcraig,marjory.selcraig@consultants.com,Sales Assistant
3,EMP003068,Aguste,O'Connor,aguste.o'connor@consultants.com,Sales Assistant
4,EMP003097,Clemens,Kopman,clemens.kopman@consultants.com,Account Manager

In [3]:
df_system_access.head()

     id    access_level
0  3045  Contract Entry
1  3051  Contract Entry
2  3068  Contract Entry
3  3097   Account Admin
4  3133  Contract Entry

In [4]:
df_system_access['id'] = df_system_access['id'].apply('EMP{0:0>6}'.format)

df_system_access.head()

          id    access_level
0  EMP003045  Contract Entry
1  EMP003051  Contract Entry
2  EMP003068  Contract Entry
3  EMP003097   Account Admin
4  EMP003133  Contract Entry

In [5]:
df_employees.rename(columns={'employee_number':'id'}, inplace = True)
df_employees.set_index('id', inplace =True)
df_system_access.set_index('id', inplace =True)
df = df_system_access.join(df_employees, how='left')
df.head()

,access_level,first_name,last_name,email,title
id,,,,,
EMP003045,Contract Entry,Lizzie,Blue,lizzie.blue@consultants.com,Sales Assistant
EMP003051,Contract Entry,Marjory,Selcraig,marjory.selcraig@consultants.com,Sales Assistant
EMP003068,Contract Entry,Aguste,O'Connor,aguste.o'connor@consultants.com,Sales Assistant
EMP003097,Account Admin,Clemens,Kopman,clemens.kopman@consultants.com,Account Manager
EMP003133,Contract Entry,Donielle,Midgley,donielle.midgley@consultants.com,Sales Assistant